src/src/Catalogs/CompanyResources.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<Catalog>
		<Properties>
			<Name>CompanyResources</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Capacity</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ResourceValue</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Teams</v8:Type>
						<v8:Type>cfg:CatalogRef.Employees</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/src/InformationRegisters/CompanyResourceTypes.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<InformationRegister>
		<Properties>
			<Name>CompanyResourceTypes</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>CompanyResourceType</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CompanyResourceTypes</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>CompanyResource</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CompanyResources</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/src/Catalogs/CompanyResources/Ext/ObjectModule.bsl
#If Server Or ThickClientOrdinaryApplication Or ExternalConnection Then

Procedure BeforeWrite(Cancel)
	
	If Not ValueIsFilled(ResourceValue) Then
		ResourceValue = Undefined;	
	EndIf;
	
	If DataExchange.Load Then 
		Return;
	EndIf;
	
EndProcedure

Procedure OnWrite(Cancel)
	
	If DataExchange.Load Then 
		Return;
	EndIf;
	
	RecordSet = InformationRegisters.CompanyResourceTypes.CreateRecordSet();
	RecordSet.Filter.CompanyResource.Set(Ref);
    RecordSet.Filter.CompanyResourceType.Set(Catalogs.CompanyResourceTypes.AllResources);
	
	NewRecord = RecordSet.Add();
	NewRecord.CompanyResourceType = Catalogs.CompanyResourceTypes.AllResources;
	NewRecord.CompanyResource = Ref;
	RecordSet.Write();
	
EndProcedure

#EndIf
